redisTestResult/redisMutiThreadsTestResult/redis_test_result_by_memtier_benchmark_F_OFF_2nd/redis_result_Gauss82_F_OFF_P2_2nd_20230717183822.log
20        Threads
5         Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         7536.06          ---          ---         2.66246         2.57500         5.18300         5.56700      8279.37 
Gets        30133.83     30133.83         0.00         2.64821         2.55900         5.15100         5.50300     32958.88 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      37669.90     30133.83         0.00         2.65106         2.55900         5.15100         5.50300     41238.25 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.111        0.000
SET       2.399        5.000
SET       2.447       10.000
SET       2.479       15.000
SET       2.495       20.000
SET       2.511       25.000
SET       2.527       30.000
SET       2.527       35.000
SET       2.543       40.000
SET       2.559       45.000
SET       2.575       50.000
SET       2.575       52.500
SET       2.575       55.000
SET       2.591       57.500
SET       2.591       60.000
SET       2.607       62.500
SET       2.607       65.000
SET       2.607       67.500
SET       2.623       70.000
SET       2.623       72.500
SET       2.639       75.000
SET       2.639       76.250
SET       2.639       77.500
SET       2.655       78.750
SET       2.655       80.000
SET       2.655       81.250
SET       2.671       82.500
SET       2.671       83.750
SET       2.687       85.000
SET       2.687       86.250
SET       2.703       87.500
SET       2.703       88.125
SET       2.719       88.750
SET       2.719       89.375
SET       2.735       90.000
SET       2.735       90.625
SET       2.751       91.250
SET       2.783       91.875
SET       2.815       92.500
SET       2.879       93.125
SET       2.959       93.750
SET       3.007       94.062
SET       3.103       94.375
SET       3.279       94.688
SET       3.519       95.000
SET       3.615       95.312
SET       3.663       95.625
SET       3.727       95.938
SET       3.791       96.250
SET       3.999       96.562
SET       4.831       96.875
SET       4.895       97.031
SET       4.927       97.188
SET       4.959       97.344
SET       4.991       97.500
SET       5.023       97.656
SET       5.023       97.812
SET       5.055       97.969
SET       5.087       98.125
SET       5.087       98.281
SET       5.119       98.438
SET       5.119       98.516
SET       5.119       98.594
SET       5.151       98.672
SET       5.151       98.750
SET       5.151       98.828
SET       5.151       98.906
SET       5.183       98.984
SET       5.183       99.062
SET       5.183       99.141
SET       5.215       99.219
SET       5.215       99.258
SET       5.215       99.297
SET       5.215       99.336
SET       5.247       99.375
SET       5.247       99.414
SET       5.247       99.453
SET       5.247       99.492
SET       5.279       99.531
SET       5.279       99.570
SET       5.279       99.609
SET       5.279       99.629
SET       5.311       99.648
SET       5.311       99.668
SET       5.311       99.688
SET       5.311       99.707
SET       5.311       99.727
SET       5.343       99.746
SET       5.343       99.766
SET       5.343       99.785
SET       5.375       99.805
SET       5.375       99.814
SET       5.375       99.824
SET       5.407       99.834
SET       5.407       99.844
SET       5.407       99.854
SET       5.439       99.863
SET       5.439       99.873
SET       5.471       99.883
SET       5.535       99.893
SET       5.599       99.902
SET       5.631       99.907
SET       5.663       99.912
SET       5.727       99.917
SET       5.759       99.922
SET       5.791       99.927
SET       5.855       99.932
SET       5.887       99.937
SET       5.919       99.941
SET       5.983       99.946
SET       6.015       99.951
SET       6.047       99.954
SET       6.079       99.956
SET       6.143       99.958
SET       6.207       99.961
SET       6.271       99.963
SET       6.335       99.966
SET       6.431       99.968
SET       6.495       99.971
SET       6.751       99.973
SET       7.039       99.976
SET       7.135       99.977
SET       7.231       99.978
SET       7.423       99.979
SET       7.807       99.980
SET       8.127       99.982
SET       8.959       99.983
SET       9.151       99.984
SET       9.151       99.985
SET       9.407       99.987
SET       9.407       99.988
SET       9.471       99.988
SET       9.471       99.989
SET       9.727       99.990
SET       9.791       99.990
SET       9.855       99.991
SET       9.919       99.991
SET      10.175       99.992
SET      10.175       99.993
SET      10.239       99.993
SET      10.559       99.994
SET      10.559       99.994
SET      10.751       99.995
SET      10.879       99.995
SET      10.943       99.995
SET      11.391       99.995
SET      11.519       99.996
SET      11.583       99.996
SET      11.583       99.996
SET      11.775       99.997
SET      11.775       99.997
SET      11.967       99.997
SET      11.967       99.997
SET      12.095       99.997
SET      12.095       99.998
SET      12.095       99.998
SET      12.095       99.998
SET      12.543       99.998
SET      12.543       99.998
SET      12.543       99.998
SET      12.607       99.998
SET      12.607       99.999
SET      12.607       99.999
SET      12.671       99.999
SET      12.671       99.999
SET      12.671       99.999
[...]
SET      12.863       99.999
SET      12.863       99.999
SET      12.863       99.999
[...]
SET      13.439       99.999
SET      13.439       99.999
SET      13.439       99.999
[...]
SET      13.439      100.000
SET      13.439      100.000
SET      13.439      100.000
[...]
SET      14.143      100.000
SET      14.143      100.000
---
GET       0.079        0.000
GET       2.399        5.000
GET       2.447       10.000
GET       2.463       15.000
GET       2.495       20.000
GET       2.511       25.000
GET       2.511       30.000
GET       2.527       35.000
GET       2.543       40.000
GET       2.559       45.000
GET       2.559       50.000
GET       2.575       52.500
GET       2.575       55.000
GET       2.575       57.500
GET       2.591       60.000
GET       2.591       62.500
GET       2.607       65.000
GET       2.607       67.500
GET       2.607       70.000
GET       2.623       72.500
GET       2.623       75.000
GET       2.639       76.250
GET       2.639       77.500
GET       2.639       78.750
GET       2.655       80.000
GET       2.655       81.250
GET       2.655       82.500
GET       2.671       83.750
GET       2.671       85.000
GET       2.687       86.250
GET       2.687       87.500
GET       2.703       88.125
GET       2.703       88.750
GET       2.703       89.375
GET       2.719       90.000
GET       2.719       90.625
GET       2.735       91.250
GET       2.751       91.875
GET       2.783       92.500
GET       2.815       93.125
GET       2.863       93.750
GET       2.895       94.062
GET       2.943       94.375
GET       3.007       94.688
GET       3.103       95.000
GET       3.407       95.312
GET       3.583       95.625
GET       3.647       95.938
GET       3.711       96.250
GET       3.791       96.562
GET       4.319       96.875
GET       4.767       97.031
GET       4.863       97.188
GET       4.927       97.344
GET       4.959       97.500
GET       4.991       97.656
GET       4.991       97.812
GET       5.023       97.969
GET       5.055       98.125
GET       5.055       98.281
GET       5.087       98.438
GET       5.087       98.516
GET       5.119       98.594
GET       5.119       98.672
GET       5.119       98.750
GET       5.151       98.828
GET       5.151       98.906
GET       5.151       98.984
GET       5.183       99.062
GET       5.183       99.141
GET       5.183       99.219
GET       5.183       99.258
GET       5.215       99.297
GET       5.215       99.336
GET       5.215       99.375
GET       5.215       99.414
GET       5.247       99.453
GET       5.247       99.492
GET       5.247       99.531
GET       5.247       99.570
GET       5.279       99.609
GET       5.279       99.629
GET       5.279       99.648
GET       5.279       99.668
GET       5.279       99.688
GET       5.311       99.707
GET       5.311       99.727
GET       5.311       99.746
GET       5.311       99.766
GET       5.343       99.785
GET       5.343       99.805
GET       5.343       99.814
GET       5.375       99.824
GET       5.375       99.834
GET       5.375       99.844
GET       5.375       99.854
GET       5.407       99.863
GET       5.407       99.873
GET       5.439       99.883
GET       5.471       99.893
GET       5.503       99.902
GET       5.535       99.907
GET       5.599       99.912
GET       5.631       99.917
GET       5.663       99.922
GET       5.695       99.927
GET       5.727       99.932
GET       5.759       99.937
GET       5.823       99.941
GET       5.855       99.946
GET       5.887       99.951
GET       5.951       99.954
GET       5.983       99.956
GET       6.015       99.958
GET       6.047       99.961
GET       6.143       99.963
GET       6.207       99.966
GET       6.335       99.968
GET       6.559       99.971
GET       6.783       99.973
GET       6.975       99.976
GET       7.135       99.977
GET       7.295       99.978
GET       7.551       99.979
GET       7.903       99.980
GET       8.511       99.982
GET       8.767       99.983
GET       8.959       99.984
GET       9.023       99.985
GET       9.215       99.987
GET       9.471       99.988
GET       9.599       99.988
GET       9.599       99.989
GET       9.727       99.990
GET       9.919       99.990
GET      10.047       99.991
GET      10.175       99.991
GET      10.239       99.992
GET      10.367       99.993
GET      10.431       99.993
GET      10.559       99.994
GET      10.623       99.994
GET      10.687       99.995
GET      10.687       99.995
GET      10.815       99.995
GET      10.815       99.995
GET      11.071       99.996
GET      11.199       99.996
GET      11.263       99.996
GET      11.327       99.997
GET      11.519       99.997
GET      11.519       99.997
GET      11.583       99.997
GET      11.583       99.997
GET      11.839       99.998
GET      11.903       99.998
GET      11.967       99.998
GET      12.095       99.998
GET      12.095       99.998
GET      12.159       99.998
GET      12.159       99.998
GET      12.159       99.999
GET      12.287       99.999
GET      12.543       99.999
GET      12.543       99.999
GET      12.607       99.999
GET      12.735       99.999
GET      12.735       99.999
GET      12.735       99.999
GET      12.799       99.999
GET      12.863       99.999
GET      12.991       99.999
GET      12.991       99.999
GET      13.311       99.999
GET      13.311       99.999
GET      13.503       99.999
GET      13.503       99.999
GET      13.759      100.000
GET      13.759      100.000
GET      13.759      100.000
GET      13.887      100.000
GET      13.887      100.000
GET      13.887      100.000
[...]
GET      13.951      100.000
GET      13.951      100.000
GET      13.951      100.000
[...]
GET      16.255      100.000
GET      16.255      100.000
---
WAIT      0.000      100.000